app/controllers/cocktails_controller.rb

SELECT "cocktails".* FROM "cocktails"
---
  def index
    @cocktails = Cocktail.all

INSERT INTO "cocktails" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Mojito"], ["created_at", "2016-07-28 07:55:06.898638"], ["updated_at", "2016-07-28 07:55:06.898638"]]
---
  def create
    @cocktail = Cocktail.new(cocktail_params)
    if @cocktail.save

SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT 1  [["id", 2]]
---
  def set_cocktail
    @cocktail = Cocktail.find(params[:id])