app/controllers/doses_controller.rb

  def create
    @dose = Dose.new(dose_params)
    @dose.cocktail = @cocktail
    if @dose.save
---
INSERT INTO "doses" ("description", "ingredient_id", "cocktail_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "lots of"], ["ingredient_id", 7], ["cocktail_id", 1], ["created_at", "2016-05-12 16:12:51.571139"], ["updated_at", "2016-05-12 16:12:51.571139"]]

  def destroy
    @dose = Dose.find(params[:id])
    @dose.destroy
---
SELECT  "doses".* FROM "doses" WHERE "doses"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "doses" WHERE "doses"."id" = $1  [["id", 2]]

  def set_cocktail
    @cocktail = Cocktail.find(params[:cocktail_id])
---
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT 1  [["id", 1]]